---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalModelIsIncorrect
source: html/8d044710-83ad-9761-f624-c1950db0a5ca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalModelIsIncorrect Property

Analytical Model is not created for the structural element.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalModelIsIncorrect { get; }
```